Revit 2023 API
StructuralSettings.SymbolicCutbackForBrace Property
 Symbolic cutback distance to be applied to all braces.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2011
Syntax
C#
public double SymbolicCutbackForBrace { get; set; }
Visual Basic
Public Property SymbolicCutbackForBrace As Double
	Get
	Set
Visual C++
public:
property double SymbolicCutbackForBrace {
	double get ();
	void set (double value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.DisabledDisciplineException |  When setting this property: None of the following disciplines is enabled: Structural.
See Also
StructuralSettings Class
Autodesk.Revit.DB.Structure Namespace